#### SERIES:-
A series is 1-D labeled array capable of holding any data types as compare to array.
the axis labels are collectively called index.
INDEX == LABELS
array = [1,2,3,4,5]
series = [1,
         2,
         3,
         4,
         5]

In [3]:
import numpy as np
import pandas as pd

In [ ]:
# # Now see how to craete a series
# labels = ['a', 'b','c']  #  create labels
# my_list = [10,20,30]     # create list
# arr = np.array([10,20,30])    # create array
# d = {1:10,2:20,3:30}    # Create dictionary

# # now come to the series
# pd.Series(my_list)   # create series from list

# #  OUTPUT =
# # 0    10
# # 1    20
# # 2    30
# # dtype: int64

0    10
1    20
2    30
dtype: int64

In [ ]:
# #  So its show the by default index now i want to change that index also:
# labels = ['a', 'b','c']  #  create labels
# my_list = [10,20,30]     # create list
# arr = np.array([10,20,30])    # create array
# d = {1:10,2:20,3:30}    # Create dictionary
# pd.Series(my_list,index=labels)  # Simply pass my own indexes

# # #  OUTPUT--
# # a    10
# # b    20
# # c    30
# # dtype: int64

a    10
b    20
c    30
dtype: int64

In [ ]:
# #  Can i create a series by using array
# #  yes, but only 1D array is acceptable, because is also 1D
# labels = ['a', 'b','c']  #  create labels
# my_list = [10,20,30]     # create list
# arr = np.array([10,20,30])    # create array
# d = {1:10,2:20,3:30}    # Create dictionary
# pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [ ]:
# #  If i use dictionary for creating series, its automatically taken index as a keys
# # How?, see
# labels = ['a', 'b','c']  #  create labels
# my_list = [10,20,30]     # create list
# arr = np.array([10,20,30])    # create array
# d = {'a':10,'b':20,'c':30}    # Create dictionary
# pd.Series(d)
# # # OUTPUT--
# # a    10
# # b    20
# # c    30
# # dtype: int64

a    10
b    20
c    30
dtype: int64

#### DATAFRAMES:-
Combining multiple series is known as DATAFRAMES

In [10]:
import numpy as np
import pandas as pd

In [ ]:
# # Creating a dataframe by using dictionary
# data = {
#     'Name':['John','Anna','Peter','Linda'],
#     'Age' :[28,34,29,42],
#     'City' :['New York', 'Paris', 'Berlin', 'London'],
#     'Salary' :[65000,70000,62000,85000]
# }
# # Now craeting a dataframe from this data
# df = pd.DataFrame(data)

# df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [ ]:
# # Creating a dataframe by using list
# data_list = [
#     ['John',28,'New York',65000],
#     ['Anna',34,'Paris',70000],
#     ['Peter',29,'Berlin',62000],
#     ['Linda',42,'London',85000]
# ]

# df2 = pd.DataFrame(data_list)
# # Whwn i used dictionary, they provide me a column name which is my key
# # But what can i do , if i want to add header(column name) like the above one
# col = ['Name','Age','City','Salary']
# # now i want to use this name in df2, so :-
# df2 = pd.DataFrame(data_list,columns=col)
# df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [ ]:
# # Selection and Indexing of column:-
# # so now if i want to target any column, how can i do that
# # df2[0], now worked like that
# # I have to pass column name in df2, like that:-
# df2['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [ ]:
# # But what if i want to call more than one column
# # so i pass list in df2, like that:-
# df2[['Name', 'City']]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [ ]:
# # You can also add column directlt, lie this:-
# df2['Designation'] = ['Doctor', 'Engineer', 'HR', 'CA']

In [ ]:
# Now I call my dataframe:-
# df2
#  here i get new column of designation

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000    Engineer
2  Peter   29    Berlin   62000          HR
3  Linda   42    London   85000          CA

In [ ]:
# # now see how to remove column:
# df2.drop('Designation',axis=1)
# # axis is required, axis=0 == row and axis=1 == column
# #  so designation column is removed

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [ ]:
# # but when i call my dataframe again, its show designation column again
# #  so for that , i use inplace here,
# # what it does, let see, it removes designation column from my original dataframe
# df2.drop('Designation',axis=1,inplace=True)
# df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [ ]:
# # So that's all about column, but what if i want to do this ops on rows
# # lets see , how it works on rows:-
# #  what if i want to select 1st row :- John	28	New York	65000

# df2.loc[0]  # loc use for location of rows
# # # OUTPUT---
# # Name          John
# # Age             28
# # City      New York
# # Salary       65000
# # Name: 0, dtype: object

# # Can i use multiple rows at onces, yes :-
# df2.loc[[0,1]]

# #  we can also use iloc for index location

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [ ]:
# # Selecting subsets of row and column
# #  how?....... see below
# #  I want o target only this:- New York	65000 , Paris	70000
# # I can select rows and column at once:-
# # df2.loc[[0,1]][['City','Salary']]

# # OUTPUT:-
# # City	Salary
# # 0	New York	65000
# # 1	Paris	70000

# # now i want to target name and age portion of peter and linda

# df2.loc[[2,3]][['Name','Age']]
# #  OUTPUT ---
# # 	Name	Age
# # 2	Peter	29
# # 3	Linda	42

    Name  Age
2  Peter   29
3  Linda   42

In [ ]:
# # Conditional Selection:-
# #  I only want to see those people whose age is more than 30
# df2[df2["Age"] >30]

# # OUTPUT ---
# # 	Name	Age	City	Salary
# # 1	Anna	34	Paris	70000
# # 3	Linda	42	London	85000

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [ ]:
# #  Now i only want people whose age is above 30 and their city must be paris
# df2[(df2["Age"] >30) & (df2["City"]=='Paris')]

# #  Use parentheses for specific condtion 
# # OUTPUT - ---

# #   Name	Age	City	Salary
# # 1	Anna	34	Paris	70000

   Name  Age   City  Salary
1  Anna   34  Paris   70000

#### MISSING DATA:-

In [39]:
import numpy as np
import pandas as pd

In [ ]:
# # FIND MISSING DATA
# data = {
#     'A':[1,2,np.nan,4,5],
#     'B':[np.nan,2,3,4,5],
#     'C':[1,2,3,np.nan,np.nan],
#     'D':[1,np.nan,np.nan,np.nan,5]
# }

# df = pd.DataFrame(data)

In [ ]:
# df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

In [ ]:
# # Now i use isna fumction to know null values in boolean
# df.isna()

       A      B      C      D
0  False   True  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [ ]:
# # Now I want to count all nullvalues:-
# df.isna().sum()

A    1
B    1
C    2
D    3
dtype: int64

In [ ]:
# #  now i want to , all the rows have null value or any of the rows have all values
# # so i use any() here to know that:-
# df.isna().any()

# # so here all the rows have nullvalues

A    True
B    True
C    True
D    True
dtype: bool

In [ ]:
# # How t remove null values:-
# # df
# # its work on the row basis:- how?,,, let See:-
# #  so here i use dropna:- and its remove all the row because I have null values in each row
# # df.dropna()
# # OUTPUT------
# # A	B	C	D  ---------- remove all the values except column name

# # See one more example:- where I use new data frame for better understanding
# data1 = {
#     'A':[1,2,np.nan,4,5],
#     'B':[1,2,3,4,5],
#     'C':[1,2,3,np.nan,np.nan],
#     'D':[1,np.nan,np.nan,np.nan,5]
# }

# df1 = pd.DataFrame(data1)
# df1

# #  Now I dont have any null value in my first row
# # now If i perform dropna here, see what i get:-
# df1.dropna()
# # OUTPUT
# #       A	B	C	D
# # 0   	1.0	1	1.0	1.0
# # So now its only showing me that row which dont have any null values
# #  Thats it , how its work

     A  B    C    D
0  1.0  1  1.0  1.0

In [ ]:
# # Threshold:-
# # We can use threshold in dropna function, what it does:-
# # lets see
# df1
# df1.dropna(thresh=3)
# # here i give thresh=3, which means each row have at least three non null value for consideration
# # 	OUTPUT
# #       A	B	C	D
# # 0 	1.0	1	1.0	1.0
# # 1 	2.0	2	2.0	NaN
# # 4 	5.0	5	NaN	5.0

# # so here only row 0,1 and 4 have three non null value
# # that's why its consider only that rows
# # FOR BETTER UNDERSTANDING:-
# # Here is my original dataframe(df1):-

# #       A	B	C	D
# # 0 	1.0	1	1.0	1.0    #three or more non null values
# # 1 	2.0	2	2.0	NaN    #three or more non null values
# # 2 	NaN	3	3.0	NaN    #only 2 non null values, not consider
# # 3 	4.0	4	NaN	NaN    #only 2 non null values, not consider
# # 4 	5.0	5	NaN	5.0    #three or more non null values

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

In [ ]:
# # Filling the missing data:-
# df
# # Here simply i use fillna() and pass parameter which i want to fiil:-
# # like that:-
# df.fillna(1)
# # OUTPUT:-
# # 	A	B	C	D
# # 0	1.0	1.0	1.0	1.0
# # 1	2.0	2.0	2.0	1.0
# # 2	1.0	3.0	3.0	1.0
# # 3	4.0	4.0	1.0	1.0
# # 4	5.0	5.0	1.0	5.0
# #  See that, its fill all nan value by 1
# # or we can say that it replace all the null values by given parameter

     A    B    C    D
0  1.0  1.0  1.0  1.0
1  2.0  2.0  2.0  1.0
2  1.0  3.0  3.0  1.0
3  4.0  4.0  1.0  1.0
4  5.0  5.0  1.0  5.0

In [66]:
# but its still not applied to my main dataframe:-
# See:- if i call again df or df1
# df
# df1
# its show me this: the original datframe
#   A	B	C	D
# 0	1.0	NaN	1.0	1.0
# 1	2.0	2.0	2.0	NaN
# 2	NaN	3.0	3.0	NaN
# 3	4.0	4.0	NaN	NaN
# 4	5.0	5.0	NaN	5.0

# So here, what is the best option which make changes in main datatframe
# so simply as we learn previously, we use inplace here
# Like that:-
# df2.drop('Designation',axis=1,inplace=True)

In [ ]:
# # what if, i want to fill different values for each column:-
# # lets see:-
# values = {'A':0,'B':100,'C':300,'D':400}
# # now i simply pass this value to the dataframe by using fillna
# # how?,,,
# df.fillna(value=values)
# # OUTPUT :-
# # 	A	B	C	D
# # 0	1.0	100.0	1.0	1.0
# # 1	2.0	2.0	2.0	400.0
# # 2	0.0	3.0	3.0	400.0
# # 3	4.0	4.0	300.0	400.0
# # 4	5.0	5.0	300.0	5.0

# # see, in the A column 2nd index have null value and its replace by 0
# # in the 'B' column 1st index have null value and its replace by 100, as our new value
# # its not applied to the main dataframe, beacuse i didn't pass the inplace=True

     A      B      C      D
0  1.0  100.0    1.0    1.0
1  2.0    2.0    2.0  400.0
2  0.0    3.0    3.0  400.0
3  4.0    4.0  300.0  400.0
4  5.0    5.0  300.0    5.0

In [ ]:
# df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

In [70]:
# KEY POINTS:-
# Use isna() for searching null values: Worked Column Wise
# Use dropna() for removing null values: Worked Row Wise
# Use fillna() for filling null values: Worked Column Wise

In [ ]:
# # Now i want to fill mean value in null values
# df.fillna(df.mean())
# # so here its take a mean of each column and replace the null values by their mean value.

     A    B    C    D
0  1.0  3.5  1.0  1.0
1  2.0  2.0  2.0  3.0
2  3.0  3.0  3.0  3.0
3  4.0  4.0  2.0  3.0
4  5.0  5.0  2.0  5.0

#### Merging, Joining and Concatenation:-

In [72]:
import numpy as np
import pandas as pd

In [ ]:
# # MERGING TWO DATAFRAMES:-

# # DATAFRAME 1:-
# employees = pd.DataFrame({
#     'emp_id':[1,2,3,4,5],
#     'name':['John','Anna','Peter','Linda','Bob'],
#     'dept':['HR','IT','Finance','IT','HR']
# })

# # DATAFRAME 2:-
# salaries = pd.DataFrame({
#     'emp_id': [1,2,3,6,7],
#     'salary': [60000,80000,65000,70000,90000],
#     'bonus': [5000,10000,7000,8000,12000]
# })

In [ ]:
# employees

   emp_id   name     dept
0       1   John       HR
1       2   Anna       IT
2       3  Peter  Finance
3       4  Linda       IT
4       5    Bob       HR

In [ ]:
# salaries

   emp_id  salary  bonus
0       1   60000   5000
1       2   80000  10000
2       3   65000   7000
3       6   70000   8000
4       7   90000  12000

In [ ]:
# So the common part is both dataframes is emp_id
# In DF1, emp_id is 1,2,3,4,5 while on the other hand
# in DF2 , emp_id is 1,2,3,6,7
# so there is 2 variation in betweeen them:-
# so what if i merge the both dataframes
# let's see
# pd.merge(employees,salaries,on='emp_id',how='inner')
# Here i give column name in 'on' parameter because its the only column which is common in both
# then i use 'how'(by default= 'inner'),what it does, its take common of the common 
# means-- emp_id is common column, and inside that --1,2,3 is the common in that column,
#  and its by default set to inner
# so after performing this , i get this output:-
# emp_id	name	dept	salary	bonus
# 0	1	John	HR	60000	5000
# 1	2	Anna	IT	80000	10000
# 2	3	Peter	Finance	65000	7000

#  but what is happening if I use outer in 'how' parameter:-
# lets see here:
# pd.merge(employees,salaries,on='emp_id',how='outer')
# its only take common column, and show all the values of that column 
# and where the values is missing , its fill by NaN

   emp_id   name     dept   salary    bonus
0       1   John       HR  60000.0   5000.0
1       2   Anna       IT  80000.0  10000.0
2       3  Peter  Finance  65000.0   7000.0
3       4  Linda       IT      NaN      NaN
4       5    Bob       HR      NaN      NaN
5       6    NaN      NaN  70000.0   8000.0
6       7    NaN      NaN  90000.0  12000.0

In [ ]:
# # Now i use left and right in 'how' parameter;
# # what it does
# # lets see
# pd.merge(employees,salaries,on='emp_id',how='left')
# # OUTPUT-
# #    emp_id	name	dept	salary	bonus
# # 0	    1	John	HR	    60000.0	5000.0
# # 1 	2	Anna	IT	    80000.0	10000.0
# # 2   	3	Peter	Finance	65000.0	7000.0
# # 3 	4	Linda	IT	     NaN	NaN
# # 4 	5	Bob	    HR	     NaN	NaN

# # its merge both the dataframes, but only give the data of employees dataframe
# # and fill NaN where the data is empty

   emp_id   name     dept   salary    bonus
0       1   John       HR  60000.0   5000.0
1       2   Anna       IT  80000.0  10000.0
2       3  Peter  Finance  65000.0   7000.0
3       4  Linda       IT      NaN      NaN
4       5    Bob       HR      NaN      NaN

In [ ]:
# # what if I use right in 'how' parameter:-
# #  simply its give me a data of salries dataframe
# # and fill the null values by NaN
# pd.merge(employees,salaries,on='emp_id',how='right')


# # So that's all about the merging.

   emp_id   name     dept  salary  bonus
0       1   John       HR   60000   5000
1       2   Anna       IT   80000  10000
2       3  Peter  Finance   65000   7000
3       6    NaN      NaN   70000   8000
4       7    NaN      NaN   90000  12000

In [ ]:
# # CONCATENATE TWO DATAFRAMES:-

# df1 = pd.DataFrame({
#     'A': ['A0','A1','A2'],
#     'B': ['B0','B1','B2'],
#     'C': ['C0','C1','C2'],
# })

# df2 = pd.DataFrame({
#     'A': ['A3','A4','A5'],
#     'B': ['B3','B4','B5'],
#     'C': ['C3','C4','C5']
# }

In [ ]:
# df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [ ]:
# df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [ ]:
# # Now here I use concatenate functionc(concat()) on my dataframes:-
# pd.concat([df1,df2])
# # pass dataframes in list, because concat funtion only takes one positional arguments:-
# # its on the column basis
# # see its add both dataframes but indexing is still same
# # so if pass df2 first in my list , its show me df2 first and add df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [ ]:
# # how can i add both dataframes on the row basis:-
# #  so as we know about axis
# # here i simply give axis=1 which target row, and bydefault its set to column (axis=0)
# pd.concat([df1,df2],axis=1)
# #  now see i get the addition of two dataframes on the row basis.

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

In [ ]:
# # JOINING of TWO DATAFRAMES:-
# #  So what is joining :-
# df1 = pd.DataFrame({
#     'Name': ['Alice','Bob','Charlie']
# },index=[1,2,3])

# df2 = pd.DataFrame({
#     'Score': [85,90,75]
# },index=[2,3,4])

In [ ]:
# df1

      Name
1    Alice
2      Bob
3  Charlie

In [ ]:
# df2

   Score
2     85
3     90
4     75

In [ ]:
# #  So lets see what join does:-
# df1.join(df2,how='outer')

# # here i joined both dataframes withh full data, and where the value is null , its fill by NaN
# #

      Name  Score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0
4      NaN   75.0

#### GROUP BY, AGGREGATION and PIVOT TABLES:-

In [2]:
import numpy as np
import pandas as pd

In [ ]:
# data = {
#     'Category': ['A','B','A','B','A','B','A','B'],
#     'Store': ['S1','S1','S2','S2','S1','S2','S2','S1'],
#     'Sales': [100,200,150,250,120,180,200,300],
#     'Quantity': [10,15,12,18,8,20,15,25],
#     'Date': pd.date_range('2023-01-01',periods=8)
# }
# df = pd.DataFrame(data)
# df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [ ]:
# #  Group by category and calculate the sum of sales:-
# # df.groupby('Category')
# #  but i am not able to see the output which i expect, even I put the above command store in any variable ,
# #  its executed but not able see because its stored it in object.
# # <pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000025467FDFA10>
# # Its show me something like this.

# # then what can i do:-
# # so we also to do sum of sales
# cat = df.groupby('Category')['Sales'].sum()
# cat 


# # so i have write it like this, and then i get the output which i expected

Category
A    570
B    930
Name: Sales, dtype: int64

In [ ]:
# # Group by store and calculate the sum of sales
# # so again i use the same code, only change Category to store
# cat = df.groupby('Store')['Sales'].sum()
# cat

Store
S1    720
S2    780
Name: Sales, dtype: int64

In [ ]:
# # Group bu multiple columns
# # Group by category and store/ 

# cat = df.groupby(['Category','Store'])['Sales'].sum()
# cat

Category  Store
A         S1       220
          S2       350
B         S1       500
          S2       430
Name: Sales, dtype: int64

In [ ]:
# # AGGREGATION:-
# # Addition of mutliple things for output
# # for example:-  mean, median, std and so on...
# df['Sales'].mean()

187.5

In [ ]:
# df['Sales'].median()

190.0

In [ ]:
# # but there is one funtion of aggregation: .agg
# # what it does, lets See:-
# df['Sales'].agg(['sum', 'mean','min','max','std','median'])


# # so if i want to perform all the ops at once , for that i use that aggregation function

sum       1500.000000
mean       187.500000
min        100.000000
max        300.000000
std         66.062741
median     190.000000
Name: Sales, dtype: float64

In [ ]:
# # PIVOT TABLES:-
# data = {
#     'Date': pd.date_range('2023-01-01',periods=20),
#     'Product': ['A','B','C','D']*5,
#     'Region': ['East','West','North','South',
#                'East','West','North','South',
#                'East','West','North','South',
#                'East','West','North','South',
#                'East','West','North','South'],
#     'Sales': np.random.randint(100,1000,20),
#     'Units': np.random.randint(10,100,20),
#     'Rep': ['John','Mary','Bob','Alice',
#             'John','Mary','Bob','Alice',
#             'John','Mary','Bob','Alice',
#             'John','Mary','Bob','Alice',
#             'John','Mary','Bob','Alice',]

# }

# df = pd.DataFrame(data)
# df['Month'] = df['Date'].dt.month_name()
# df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
# df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    955     53   John  January      Q1
1  2023-01-02       B   West    627     26   Mary  January      Q1
2  2023-01-03       C  North    427     49    Bob  January      Q1
3  2023-01-04       D  South    925     27  Alice  January      Q1
4  2023-01-05       A   East    417     73   John  January      Q1
5  2023-01-06       B   West    831     86   Mary  January      Q1
6  2023-01-07       C  North    699     97    Bob  January      Q1
7  2023-01-08       D  South    507     90  Alice  January      Q1
8  2023-01-09       A   East    551     68   John  January      Q1
9  2023-01-10       B   West    495     76   Mary  January      Q1
10 2023-01-11       C  North    995     21    Bob  January      Q1
11 2023-01-12       D  South    541     59  Alice  January      Q1
12 2023-01-13       A   East    584     21   John  January      Q1
13 2023-01-14       B   West    977     46   Mary  January      Q1
14 2023-01-15       C  North    558     66    Bob  January      Q1
15 2023-01-16       D  South    300     96  Alice  January      Q1
16 2023-01-17       A   East    869     24   John  January      Q1
17 2023-01-18       B   West    626     23   Mary  January      Q1
18 2023-01-19       C  North    607     10    Bob  January      Q1
19 2023-01-20       D  South    226     54  Alice  January      Q1

In [ ]:
# # Now I want to convert all that index to Region 
# # And All product have their column A ,B ,C ,D
# # But how can i do this:-
# # so simply i use pivot table function here.....,

# pd.pivot_table(df,values='Sales',index='Region',columns='Product')

# # So its create a pivot table for me, but there is so many NaN values, 
# # So see in the data product 'A' have only east region and same thing for other products
# # And its show me mean of sales accordingly bacause i choose sales i value
# #  why its show me mean, because its set by default 



# #  if i want median of sales columnn , then i have pass aggfunc in my parameter.
# # see below

Product      A      B      C      D
Region
East     675.2    NaN    NaN    NaN
North      NaN    NaN  657.2    NaN
South      NaN    NaN    NaN  499.8
West       NaN  711.2    NaN    NaN

In [ ]:
# pd.pivot_table(df,values='Sales',index='Region',columns='Product',aggfunc='median')
# # so here its provides an median of sales column
# # So that's it , how its works
# # What is the use of this
# #  so its mainly used for heatmap where we have large number of data

Product      A      B      C      D
Region
East     584.0    NaN    NaN    NaN
North      NaN    NaN  607.0    NaN
South      NaN    NaN    NaN  507.0
West       NaN  627.0    NaN    NaN

In [ ]:
# #  For better clarification , i used multiple values :-
# # example:-

# pivot2 = pd.pivot_table(df,values=['Sales','Units'],index='Region',columns='Product',aggfunc='median')
# pivot2

# # You alway have to pass numeric data in values , otherwise you got error
# # Why always num,eric data, because if i pass any categorical data its show me aggregation failed
# # because string types data dont have mean median or any other aggregate ops.

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     584.0    NaN    NaN    NaN  53.0   NaN   NaN   NaN
North      NaN    NaN  607.0    NaN   NaN   NaN  49.0   NaN
South      NaN    NaN    NaN  507.0   NaN   NaN   NaN  59.0
West       NaN  627.0    NaN    NaN   NaN  46.0   NaN   NaN

In [ ]:
# #  Now there is 0one more things with pivot table, whichn is cross tab;-
# #  let see what is this:-
# #  the only diff is : we use aggregate function in pivot table and we use count function in cross tabs;
# #  lets see how>?
# pd.crosstab(df['Region'],df['Product'])

# #  So see , i get counts of products in each region
# # pivot table == aggregation
# # cross tabs == counts

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0

#### OPERATIONS :- For Data Preprocessing

In [ ]:
# # Dataframes :- Basic OPs
# df1 = pd.DataFrame({
#     'A': [1,2,3,4,5],
#     'B': [10,20,30,40,50],
#     'C': [100,200,300,400,500]
# })

In [ ]:
# df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [ ]:
# df1.shape

(5, 3)

In [ ]:
# df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [ ]:
# df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [ ]:
# df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [ ]:
# # Applying function on Dataframes:-
# df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [ ]:
# # Now i want to square the values of column 'B':-
# #  So here I use function for that:-
# def square(x):
#     return x**2

In [ ]:
# #  So in the above cell, I create a function for square, but How can I apply to the dataframe.
# # So I apply that function on column 'B' in my dataframe
# #  see how?....,
# df1['B'].apply(square)
# # so I get a square of each value in column 'B'
# # but its not apply on my ain dataframe:

0     100
1     400
2     900
3    1600
4    2500
Name: B, dtype: int64

In [ ]:
# df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [ ]:
# # let see our dataframe
# # so I didn't get the square value of column 'B', because its not applied
# # So if i want to update that changes in my main dataframe:
# #  simply I put that ops syntax in column "B"
# # HOW>>???? see....,
# df1['B'] = df1['B'].apply(square)
# # now i call my dataframe

In [ ]:
# df1

   A     B    C
0  1   100  100
1  2   400  200
2  3   900  300
3  4  1600  400
4  5  2500  500

In [ ]:
# # And what if , i do something like this:-
# df1['D'] = df1['B'].apply(square)

In [ ]:
# df1
# # So its take an updated value of B and create a new column of square of that updated value
# #

   A     B    C        D
0  1   100  100    10000
1  2   400  200   160000
2  3   900  300   810000
3  4  1600  400  2560000
4  5  2500  500  6250000